name: "model_TRT_FP16"
platform: "tensorrt_plan"
max_batch_size: 8

input {
  name: "INPUT_IDS"
  data_type: TYPE_INT32
  dims: [ 128 ]
}
input {
  name: "ATTENTION_MASK"
  data_type: TYPE_INT32
  dims: [ 128 ]
}

output {
  name: "EMBEDDINGS"
  data_type: TYPE_FP32
  dims: [ -1, 2 ]
}

instance_group {
  count: 1
  kind: KIND_GPU
}